[
    {
        "id": 2,
        "subject_id": 2,
        "name": "2",
        "date": "2025-03-01",
        "chapter": null,
        "created_at": "2025-03-01T18:43:25.339541",
        "audio_path": "C:\\Programming\\AI\\Transcriber\\app\\data\\recordings\\recording_20250303-012842.wav",
        "transcript": " Hello, hello, hello.",
        "summary": "1. Introduction: The class began with a greeting from the instructor.\n2. Topic Discussion: The focus of the lecture was on \"Circular Functions.\"\n3. Definition: Circular functions were described as trigonometric functions that operate on angles in radian measure.\n4. Sine Function: The sine function was introduced, defined as the y-coordinate of a point on the unit circle when an angle θ is measured counterclockwise from the positive x-axis.\n5. Cosine Function: The cosine function was explained as the x-coordinate of a point on the unit circle when an angle θ is measured counterclockwise from the positive x-axis.\n6. Tangent Function: The tangent function was defined as the ratio of the sine and cosine functions.\n7. Unit Circle: The unit circle was mentioned as a helpful visual aid for understanding circular functions.\n8. No further details or examples were provided in the transcript, so no additional points are included.",
        "flashcards": []
    },
    {
        "id": 3,
        "subject_id": 3,
        "name": "2",
        "date": "2025-03-03",
        "chapter": null,
        "created_at": "2025-03-03T01:37:01.936928",
        "audio_path": "C:\\Programming\\AI\\Transcriber\\app\\data\\recordings\\recording_20250303-013727.wav",
        "transcript": " Hello, this class is going to be about ducks and dogs. Nothing else just ducks and dogs. The only thing I want you guys to learn for the exam tomorrow is that dogs can outlive ducks by around 10 years, give or take, and that they are three times as intelligent.",
        "summary": "1. Topic of the class: Ducks and Dogs\n2. Exam focus: Information about lifespan and intelligence of ducks and dogs\n3. Duck lifespan: Approximately 5-10 years\n4. Dog lifespan: Around 15-20 years (10 years more than ducks)\n5. Intelligence comparison: Dogs are three times as intelligent as ducks",
        "flashcards": []
    },
    {
        "id": 4,
        "subject_id": 3,
        "name": "french",
        "date": "2025-03-03",
        "chapter": null,
        "created_at": "2025-03-03T01:39:32.068078",
        "audio_path": "C:\\Programming\\AI\\Transcriber\\app\\data\\recordings\\recording_20250303-014045.wav",
        "transcript": "Du coup, la dernière fois on a parlé des raisons pourquoi on pensait que l'art n'était pas une activité technique. C'était une activité qui nécessitait une autre partie du cerveau. On a référencé le génie dans les sociétés grecques anciennes et avec les muses on a parlé du génie. Maintenant on est en train de dire que la théorie de Göbel n'est pas si sûre puisqu'en effet il est impossible pour tout le monde de se mettre d'accord sur une interprétation de l'art et du coup ce serait impossible pour l'art d'être considéré un moyen par lequel une société avance vers un autre futur commun. C'est à dire l'idée qu'avait implanté l'artiste dans l'œuvre artistique. Cette idée peut être perçue différemment en dépendant des personnes.",
        "summary": " **Résumé du cours sur l'Art et sa signification**\n\n1. **Contexte de discussion**\n    - La dernière fois, on a abordé les raisons pourquoi on pensait que l'art n'était pas une activité technique.\n\n2. **Raisons pourquoi on pensait que l'art n'était pas technique**\n    - L'activité nécessitait une partie du cerveau différente de celle utilisée pour les activités techniques.\n    - On a fait référence au génie dans les sociétés grecques anciennes, en particulier avec les muses.\n\n3. **Doute sur la théorie de Göbel**\n    - La théorie de Göbel, selon laquelle l'art serait un moyen par lequel une société avancerait vers un autre futur commun, est remise en question.\n    - Il est impossible pour tout le monde de s'accorder sur une interprétation de l'art.\n    - Ainsi, considérer l'art comme un moyen d'avancer vers un autre futur commun serait impossible.\n\n4. **Impact de la perception individuelle**\n    - Cette idée que l'artiste avait implantée dans son œuvre peut être perçue différemment en fonction des personnes.",
        "flashcards": []
    }
]