[
    {
        "id": 4,
        "subject_id": 3,
        "name": "french",
        "date": "2025-03-03",
        "chapter": null,
        "created_at": "2025-03-03T01:39:32.068078",
        "audio_path": "C:\\Programming\\AI\\Transcriber\\app\\data\\recordings\\recording_20250303-014045.wav",
        "transcript": "Du coup, la dernière fois on a parlé des raisons pourquoi on pensait que l'art n'était pas une activité technique. C'était une activité qui nécessitait une autre partie du cerveau. On a référencé le génie dans les sociétés grecques anciennes et avec les muses on a parlé du génie. Maintenant on est en train de dire que la théorie de Göbel n'est pas si sûre puisqu'en effet il est impossible pour tout le monde de se mettre d'accord sur une interprétation de l'art et du coup ce serait impossible pour l'art d'être considéré un moyen par lequel une société avance vers un autre futur commun. C'est à dire l'idée qu'avait implanté l'artiste dans l'œuvre artistique. Cette idée peut être perçue différemment en dépendant des personnes.",
        "summary": " **Résumé du cours sur l'Art et sa signification**\n\n1. **Contexte de discussion**\n    - La dernière fois, on a abordé les raisons pourquoi on pensait que l'art n'était pas une activité technique.\n\n2. **Raisons pourquoi on pensait que l'art n'était pas technique**\n    - L'activité nécessitait une partie du cerveau différente de celle utilisée pour les activités techniques.\n    - On a fait référence au génie dans les sociétés grecques anciennes, en particulier avec les muses.\n\n3. **Doute sur la théorie de Göbel**\n    - La théorie de Göbel, selon laquelle l'art serait un moyen par lequel une société avancerait vers un autre futur commun, est remise en question.\n    - Il est impossible pour tout le monde de s'accorder sur une interprétation de l'art.\n    - Ainsi, considérer l'art comme un moyen d'avancer vers un autre futur commun serait impossible.\n\n4. **Impact de la perception individuelle**\n    - Cette idée que l'artiste avait implantée dans son œuvre peut être perçue différemment en fonction des personnes.",
        "flashcards": []
    },
    {
        "id": 6,
        "subject_id": 4,
        "name": "SVT",
        "date": "2025-03-03",
        "chapter": null,
        "created_at": "2025-03-03T10:37:49.367375",
        "audio_path": "C:\\LectureLogAI\\LectureLogAI\\app\\data\\recordings\\Cité Scolaire Grand Air.m4a",
        "transcript": "Transcription failed: [WinError 2] The system cannot find the file specified",
        "summary": null,
        "language": "unknown",
        "flashcards": []
    },
    {
        "id": 7,
        "subject_id": 3,
        "name": "2",
        "date": "2025-03-03",
        "chapter": null,
        "created_at": "2025-03-03T11:43:38.608489",
        "audio_path": null,
        "transcript": null,
        "summary": null,
        "language": null,
        "flashcards": []
    },
    {
        "id": 8,
        "subject_id": 4,
        "name": "1",
        "date": "2025-03-03",
        "chapter": null,
        "created_at": "2025-03-03T16:00:37.871831",
        "audio_path": "C:\\LectureLogAI\\LectureLogAI\\app\\data\\recordings\\recording_20250303-175107.wav",
        "transcript": "Je m'appelle Claude. J'espère que vous allez bien aujourd'hui. J'espère que vous allez bien aujourd'hui.",
        "summary": "Text too short to summarize",
        "language": "fr",
        "flashcards": []
    },
    {
        "id": 9,
        "subject_id": 4,
        "name": "maths 3",
        "date": "2025-03-10",
        "chapter": null,
        "created_at": "2025-03-10T17:35:16.295784",
        "audio_path": "C:\\LectureLogAI\\LectureLogAI\\app\\data\\recordings\\recording_20250310-173657.wav",
        "transcript": "Merci.",
        "summary": null,
        "language": "fr",
        "flashcards": []
    }
]